Autodesk.Revit.DB.SketchedStairsCurveData.#ctor(Autodesk.Revit.DB.Curve,System.Double,Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption)
Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015